app/views/conference_histories/new.html.erb

SELECT "schools".* FROM "schools"
---
        </label>
        <%= select_tag(:school_id, options_from_collection_for_select(School.all, :id, :school_name, @conference_history.school_id), :class => "form-control") %>

SELECT "conferences".* FROM "conferences"
---
        </label>
        <%= select_tag(:conference_id, options_from_collection_for_select(Conference.all, :id, :conference_name, @conference_history.conference_id), :class => "form-control") %>