app/views/conferences/show.html.erb

<ul class="list-group">
  <% @conference.conference_histories.each do |conference_history| %>
---
SELECT "conference_histories".* FROM "conference_histories" WHERE "conference_histories"."conference_id" = ?  [["conference_id", 1]]