app/views/schools/show.html.erb

SELECT "conference_histories".* FROM "conference_histories" WHERE "conference_histories"."school_id" = ?  [["school_id", 10]]
---
<ul class="list-group">
  <% @school.conference_histories.each do |conference_history| %>