app/controllers/conferences_controller.rb

SELECT "conferences".* FROM "conferences"
---
  def index
    @conferences = Conference.all

SELECT  "conferences".* FROM "conferences" WHERE "conferences"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @conference = Conference.find(params[:id])

INSERT INTO "conferences" ("headquarters", "members", "founded", "conference_nickname", "conference_name", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @conference = Conference.new
    @conference.headquarters = params[:headquarters]
    @conference.members = params[:members]
    @conference.founded = params[:founded]
    @conference.conference_nickname = params[:conference_nickname]
    @conference.conference_name = params[:conference_name]
    @conference.image_url = params[:image_url]

    if @conference.save

SELECT  "conferences".* FROM "conferences" WHERE "conferences"."id" = ? LIMIT 1  [["id", 7]]
---
  def edit
    @conference = Conference.find(params[:id])

SELECT  "conferences".* FROM "conferences" WHERE "conferences"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "conferences" SET "headquarters" = ?, "updated_at" = ? WHERE "conferences"."id" = ?  [["headquarters", "America"], ["updated_at", "2016-06-10 07:06:29.406780"], ["id", 7]]
---
  def update
    @conference = Conference.find(params[:id])

    @conference.headquarters = params[:headquarters]
    @conference.members = params[:members]
    @conference.founded = params[:founded]
    @conference.conference_nickname = params[:conference_nickname]
    @conference.conference_name = params[:conference_name]
    @conference.image_url = params[:image_url]

    if @conference.save