app/controllers/conference_histories_controller.rb

  def index
    @conference_histories = ConferenceHistory.all
---
SELECT "conference_histories".* FROM "conference_histories"

  def show
    @conference_history = ConferenceHistory.find(params[:id])
---
SELECT  "conference_histories".* FROM "conference_histories" WHERE "conference_histories"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @conference_history = ConferenceHistory.new
    @conference_history.left = params[:left]
    @conference_history.joined = params[:joined]
    @conference_history.conference_id = params[:conference_id]
    @conference_history.school_id = params[:school_id]

    if @conference_history.save
---
INSERT INTO "conference_histories" ("left", "joined", "conference_id", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["left", 2016], ["joined", 2005], ["conference_id", 1], ["school_id", 4], ["created_at", "2016-06-10 02:54:08.675875"], ["updated_at", "2016-06-10 02:54:08.675875"]]

  def edit
    @conference_history = ConferenceHistory.find(params[:id])
---
SELECT  "conference_histories".* FROM "conference_histories" WHERE "conference_histories"."id" = ? LIMIT 1  [["id", 47]]

  def destroy
    @conference_history = ConferenceHistory.find(params[:id])

    @conference_history.destroy
---
SELECT  "conference_histories".* FROM "conference_histories" WHERE "conference_histories"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "conference_histories" WHERE "conference_histories"."id" = ?  [["id", 2]]