app/controllers/schools_controller.rb

  def show
    @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 10]]

  def create
    @school = School.new
    @school.joined = params[:joined]
    @school.school_nickname = params[:school_nickname]
    @school.conference_name = params[:conference_name]
    @school.school_name = params[:school_name]
    @school.image_url = params[:image_url]

    if @school.save
---
INSERT INTO "schools" ("joined", "school_nickname", "conference_name", "school_name", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @school = School.find(params[:id])

    @school.joined = params[:joined]
    @school.school_nickname = params[:school_nickname]
    @school.conference_name = params[:conference_name]
    @school.school_name = params[:school_name]
    @school.image_url = params[:image_url]

    if @school.save
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "schools" SET "image_url" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["image_url", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Miami_Hurricanes_logo.svg/2000px-Miami_Hurricanes_logo.svg.png"], ["updated_at", "2016-06-10 02:37:52.953869"], ["id", 10]]

  def destroy
    @school = School.find(params[:id])

    @school.destroy
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "schools" WHERE "schools"."id" = ?  [["id", 1]]